const Exp = {
    1 : <>
            <div>미애씨는 "약을 끊지 못하고 우울함이 지속되면 실패자이다."라는 당위 진술의 오류를 범하고 있습니다.</div>
            <div>당위 진술이라는 함정에 빠져있게 되면, 자신을 더욱 자책하게 되고 제대로 해내지 못하는 사람이라는 생각에 수치심이 들며, 자신을 더욱 압박하게 되기 때문에 우울감이 이전보다 심해질 수 있습니다.</div>
        </>,
    2 : <>
            <div>물론 한번의 기억이 크게 남아 다음번 치료가 두려운 것은 당연한 것이지만, 분명히 호전된 경험이 있음에도 불구하고 재발하였다는 사실로 인해 치료가 소용없다고 치부해버리는 것은 지나친 일반화의 오류입니다.</div>
            <div>비록 공황이 재발하였지만 이전과 비교해볼 때 그 빈도가 조금 더 적어졌을 수도 있고, 이전과 다르게 대처할 수도 있기 때문입니다.</div>
        </>,
    3 : <>
            <div></div>

        </>,
    4 : <>
    
        </>,
}
Object.freeze(Exp);

export default Exp;